ExitApp
;=======================================================================================================================
;WoWLocalFilesManagement模块:
;Mod = About
;控件前缀: AB_
;需修改下面三个线程名称: AddMod_, GuiSize_, GuiInit_
;=======================================================================================================================
;新增模块所需函数库 |
;==================

;=======================================================================================================================
;新增模块线程 |
;=============
AddMod_About:
	;模块部署

	;在MainGui的TAB上:
	Gui, MainGui:Add, Text, xm+10 ym+33 Section, % "作者:nnrxin"
	Gui, MainGui:Add, Text, xs ys+25, % "邮箱:nnrxin@163.com"
	Gui, MainGui:Add, Text, xs ys+50, % "NGA发布网址:"
	Gui, MainGui:Add, Edit, x+5 yp-3 ReadOnly, % "https://bbs.nga.cn/read.php?tid=9550429"
	Gui, MainGui:Add, Text, xs ys+75, % "github网址:"
	Gui, MainGui:Add, Edit, x+5 yp-3 ReadOnly, % "https://github.com/nnrxin/WoWLocalFilesManagement"
	
	;~ Gui, MainGui:Add, 
return

;=======================================================================================================================
;模块初始化 |
;===========
GuiInit_About:
	
return

;=======================================================================================================================
;模块上控件动作 |
;==============


;=======================================================================================================================
;模块GUI附属 |
;============

;GUI尺寸控制:
GuiSize_About:
	;~ AutoXYWH("w h", "vHK_LVmain")
return


;=======================================================================================================================
;模块GUI附属动作$函数 |
;====================
